---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.HasNoConnections
source: html/08c12d80-da91-94da-21d2-a4687353812a.htm
---
# Autodesk.Revit.DB.FabricationPart.HasNoConnections Method

Checks to see if all the fabrication part's connectors are open.

## Syntax (C#)
```csharp
public bool HasNoConnections()
```

## Returns
Returns true if the part has zero connections.